DROP TABLE IF EXISTS products CASCADE;
DROP TABLE IF EXISTS type_product CASCADE;

create table type_product(
    id serial primary key,
    type_name varchar(50)
);

create table products(
    id serial primary key,
    product_name varchar(50),
    type_id int references type_product(id),
    expired_date timestamp,
    price float
);

insert into type_product (type_name) values
('СЫР'),
('МОЛОКО'),
('ЙОГУРТ'),
('КЕФИР'),
('ТВОРОГ'),
('МАСЛО'),
('СЛИВКИ'),
('СМЕТАНА');


insert into products (product_name, type_id, expired_date, price) values
('Сыр Моцарелла', 1, '2025-05-10', 300.50),
('Сыр Пармезан', 1, '2025-06-15', 700.00),
('Сыр Чеддер', 1, '2025-05-20', 450.00),
('Сыр Камамбер', 1, '2025-05-01', 650.00),
('Сыр Рокфор', 1, '2025-04-25', 720.00),

('Молоко Домик в деревне', 2, '2025-04-30', 90.00),
('Молоко Простоквашино', 2, '2025-04-28', 95.00),
('Молоко 36 копеек', 2, '2025-04-29', 85.00),
('Молоко Parmalat', 2, '2025-06-01', 110.00),
('Молоко Valio', 2, '2025-05-15', 120.00),
('Молоко Актуаль', 2, '2025-04-27', 88.00),
('Молоко Parmalat', 2, '2025-06-01', 720.00),

('Йогурт Активиа', 3, '2025-04-26', 60.00),
('Йогурт Чудо', 3, '2025-04-27', 58.00),
('Йогурт Epica', 3, '2025-04-30', 70.00),
('Йогурт Danone', 3, '2025-05-02', 65.00),

('Кефир Домик в деревне', 4, '2025-05-03', 75.00),
('Кефир Простоквашино', 4, '2025-04-29', 70.00),
('Кефир 36 копеек', 4, '2025-05-01', 68.00),

('Творог 5%', 5, '2025-04-26', 130.00),
('Творог 9%', 5, '2025-04-28', 135.00),
('Творог Домик в деревне', 5, '2025-04-27', 145.00),

('Масло сливочное Крестьянское', 6, '2025-06-10', 210.00),
('Масло Вологодское', 6, '2025-06-12', 250.00),

('Сливки Простоквашино', 7, '2025-06-01', 160.00),
('Сливки Домик в деревне', 7, '2025-06-03', 170.00),

('Сметана 15%', 8, '2025-05-01', 90.00),
('Сметана 20%', 8, '2025-05-05', 95.00),
('Сметана Простоквашино', 8, '2025-05-04', 100.00);
